DataProcessors/А_ОбработкаДисбалансаПоПодразделениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_ОбработкаДисбалансаПоПодразделениям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыДисбаланса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеПриход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеРасход</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокВзаимозачетЗадолженности</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВзаимозачета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДисбаланса</Name>
							<Comment>Статья дисбаланса по подразделению</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ДисбалансПоПодразделению</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасхождение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасхождениеДоговор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПрочиеАктивыПассивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеАктивыПассивы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиУправленческогоБаланса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>00004303</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортКомиссия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРасчетовСПартнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыРасчетовСПартнерами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКредитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСДебитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСЛизингодателем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийВзаимозачетаЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаимозачетаЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуКлиентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуПоставщиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставщикаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыУчастниковВзаимозачета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыУчастниковВзаимозачета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияПоставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядокРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОсвобожденаОтНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОформленияЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОформленияЗакупок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРазделять</Name>
					<Comment>Переход права собственности и поступление на склад в фин. учете оформляются одним документом "Приобретение товаров и услуг"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
					<Comment>Переход права собственности оформляется документом "Приобретение товаров и услуг", затем оформляется поступление на склад в фин. учете документом "Поступление на склад"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеотфактурованныеПоставки</Name>
					<Comment>Поступление на склад в фин. учете оформляется документом "Поступление на склад", затем оформляется переход права собственности документом "Приобретение товаров и услуг"</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/А_ОбработкаДисбалансаПоПодразделениям/Ext/ObjectModule.bsl
// ============================================================================
// А_ОбработкаДисбалансаПоПодразделениям — Модуль объекта
// ============================================================================
// Масовий аналіз дисбалансу управлінського балансу по підрозділах за період.
// Запускається після закриття місяця (РасчетСебестоимости виконаний,
// баланс по організації сходиться, залишилось звести по підрозділах).
//
// Кнопка "Аналіз документів": заповнює ТЧ ДокументыДисбаланса
//   Для кожного документа, у якого є дисбаланс по N >= 2 підрозділах
//   і баланс по організації = 0, виконується ЖАДНЕ СПІВСТАВЛЕННЯ:
//   сортуємо Дебіторів (Контроль > 0) і Кредиторів (Контроль < 0) по
//   убуванню |Контроль|, формуємо пари (Дт, Кт, Сума = min(|Дт|,|Кт|)),
//   доки списки не вичерпаються. На кожну пару додається окремий рядок ТЧ.
//
// Кнопка "Створити документи": для кожного необробленого рядка створює
//   окремий документ ВзаимозачетЗадолженности. Логіка створення ВНУТРІ
//   цієї обробки (не викликаємо іншу), щоб правки були в одній EPF.
// ============================================================================

Процедура АнализДокументов() Экспорт

	ДокументыДисбаланса.Очистить();

	Если НЕ ЗначениеЗаполнено(НачалоПериода) ИЛИ НЕ ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		Сообщить("Не заполнен период!");
		Возврат;
	КонецЕсли;

	// === 1. Запит оборотів за період по Регистратор + Подразделение ===

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Об.Регистратор КАК Документ,
	|	Об.Подразделение КАК Подразделение,
	|	Об.Организация КАК Организация,
	|	Об.СуммаПриход КАК Дебет,
	|	Об.СуммаРасход КАК Кредит,
	|	Об.СуммаПриход - Об.СуммаРасход КАК Контроль
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы.Обороты(
	|		&НачалоПериода, &ОкончаниеПериода, Регистратор, ) КАК Об
	|ГДЕ
	|	НЕ Об.Статья В (
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств))
	|УПОРЯДОЧИТЬ ПО
	|	Об.Регистратор";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(ОкончаниеПериода));

	ТаблицаОборотов = Запрос.Выполнить().Выгрузить();
	Сообщить("Обороты: " + ТаблицаОборотов.Количество() + " строк");

	// === 2. Групування: Документ -> Підрозділ -> СУМА(Контроль) ===

	СоответствиеДокументов = Новый Соответствие;
	ДокументыСДисбалансом = Новый Соответствие; // XML(Документ) -> Массив пар

	Для Каждого Строка Из ТаблицаОборотов Цикл
		КлючДок = XMLСтрока(Строка.Документ);

		Если СоответствиеДокументов.Получить(КлючДок) = Неопределено Тогда
			СоответствиеДокументов.Вставить(КлючДок, Новый Структура(
				"ДокументСсылка, Организация, ПодразделенияСоотв",
				Строка.Документ, Строка.Организация, Новый Соответствие));
		КонецЕсли;

		Данные = СоответствиеДокументов.Получить(КлючДок);
		КлючПодр = XMLСтрока(Строка.Подразделение);
		СущПодр = Данные.ПодразделенияСоотв.Получить(КлючПодр);
		Если СущПодр = Неопределено Тогда
			Данные.ПодразделенияСоотв.Вставить(КлючПодр, Новый Структура(
				"Подразделение, Контроль", Строка.Подразделение, Строка.Контроль));
		Иначе
			СущПодр.Контроль = СущПодр.Контроль + Строка.Контроль;
		КонецЕсли;
	КонецЦикла;

	Сообщить("Уникальных документов: " + СоответствиеДокументов.Количество());

	// === 3. Фільтрація + жадне співставлення в пари ===

	Для Каждого КлючЗначение Из СоответствиеДокументов Цикл
		Данные = КлючЗначение.Значение;
		ПодразделенияСоотв = Данные.ПодразделенияСоотв;

		// Пропустити авто-створені взаємозаліки
		ДокСсылка = Данные.ДокументСсылка;
		Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
			Если ЗначениеЗаполнено(ДокСсылка.А_ДокументОснованиеДляБаланса) Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		// Сума контролю по всіх підрозділах — має бути 0
		ИтогоКонтроль = 0;
		Для Каждого КЗП Из ПодразделенияСоотв Цикл
			ИтогоКонтроль = ИтогоКонтроль + КЗП.Значение.Контроль;
		КонецЦикла;
		Если Окр(ИтогоКонтроль, 2) <> 0 Тогда
			Продолжить;
		КонецЕсли;

		// Мінімум 2 підрозділи з дисбалансом
		КолДисб = 0;
		Для Каждого КЗП Из ПодразделенияСоотв Цикл
			Если Окр(КЗП.Значение.Контроль, 2) <> 0 Тогда
				КолДисб = КолДисб + 1;
			КонецЕсли;
		КонецЦикла;
		Если КолДисб < 2 Тогда
			Продолжить;
		КонецЕсли;

		// === 3.1 ЖАДНЕ СПІВСТАВЛЕННЯ ПАР ===
		СписокПар = РассчитатьПарыДисбаланса(ПодразделенияСоотв);
		Если СписокПар.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		// Фільтр по підрозділу (якщо вибрано) — залишити тільки пари з участю цього підрозділу
		Если ЗначениеЗаполнено(Подразделение) Тогда
			НовийСписок = Новый Массив;
			Для Каждого ПАРА Из СписокПар Цикл
				Если ПАРА.ПодрДебитор = Подразделение ИЛИ ПАРА.ПодрКредитор = Подразделение Тогда
					НовийСписок.Добавить(ПАРА);
				КонецЕсли;
			КонецЦикла;
			СписокПар = НовийСписок;
			Если СписокПар.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		ДокументыСДисбалансом.Вставить(КлючЗначение.Ключ, СписокПар);

		ДокОснование = Данные.ДокументСсылка;

		// === 3.2 Для кожної пари — окремий рядок ТЧ ===
		Для Каждого ПАРА Из СписокПар Цикл
			ПодрДт = ПАРА.ПодрДебитор;
			ПодрКт = ПАРА.ПодрКредитор;
			СуммаПары = ПАРА.Сумма;

			// Визначити контрагентів пари
			ПартнерДт = НайтиПартнераПоПодразделению(ПодрДт);
			ПартнерКт = НайтиПартнераПоПодразделению(ПодрКт);
			КонтрагентДт = ?(ПартнерДт = Неопределено, Неопределено, НайтиКонтрагентаПоПартнеру(ПартнерДт));
			КонтрагентКт = ?(ПартнерКт = Неопределено, Неопределено, НайтиКонтрагентаПоПартнеру(ПартнерКт));

			// Знайти існуючий взаємозалік по ТРОЙЦІ (Основа, КонтрагентДт, КонтрагентКт)
			СущВзаимозачет = НайтиВзаимозачетПоТройке(ДокОснование, КонтрагентДт, КонтрагентКт);

			ВзаимозачетСсылка = Неопределено;
			СуммаВзаимозачета = 0;
			Обработан = Ложь;
			РасхождениеДог = Ложь;

			Если ЗначениеЗаполнено(СущВзаимозачет) Тогда
				ВзаимозачетСсылка = СущВзаимозачет;
				СуммаВзаимозачета = СущВзаимозачет.СуммаРегл;
				РасхождениеДог = ПроверитьДоговорыВзаимозачета(СущВзаимозачет, ПодрДт, ПодрКт);
				Если СущВзаимозачет.Проведен И Окр(СуммаВзаимозачета - СуммаПары, 2) = 0 И НЕ РасхождениеДог Тогда
					Обработан = Истина;
				КонецЕсли;
			КонецЕсли;

			Если НЕ ПоказыватьВсе И Обработан Тогда
				Продолжить;
			КонецЕсли;

			СтатьяДисбаланса = ОпределитьСтатьюДисбаланса(ДокОснование, ПодрДт, ПодрКт);

			НС = ДокументыДисбаланса.Добавить();
			НС.Обработан = Обработан;
			НС.Документ = ДокОснование;
			НС.ПодразделениеПриход = ПодрДт;
			НС.ПодразделениеРасход = ПодрКт;
			НС.СуммаДокумента = СуммаПары;
			НС.ДокВзаимозачетЗадолженности = ВзаимозачетСсылка;
			НС.СуммаВзаимозачета = СуммаВзаимозачета;
			НС.СтатьяДисбаланса = СтатьяДисбаланса;
			НС.СуммаРасхождение = СуммаПары - СуммаВзаимозачета;
			НС.РасхождениеДоговор = РасхождениеДог;
		КонецЦикла;
	КонецЦикла;

	// === 4. Знайти "зайві" Взаємозаліки ===
	// Зайвий = створений автоматично (А_ДокументОснованиеДляБаланса заповнений),
	// але пара (КонтрагентДт, КонтрагентКт) вже НЕ потрібна в поточному аналізі

	ЗапросЗайвих = Новый Запрос;
	ЗапросЗайвих.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.А_ДокументОснованиеДляБаланса КАК ДокОснование,
	|	Док.СуммаРегл КАК СуммаРегл,
	|	Док.А_СтатьяДисбалансаПоПодразделению КАК СтатьяДисбаланса,
	|	Док.КонтрагентДебитор КАК КонтрагентДебитор,
	|	Док.КонтрагентКредитор КАК КонтрагентКредитор
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК Док
	|ГДЕ
	|	Док.Дата МЕЖДУ &Нач И &Кон
	|	И Док.А_ДокументОснованиеДляБаланса <> НЕОПРЕДЕЛЕНО
	|	И Док.Проведен
	|	И НЕ Док.ПометкаУдаления";
	ЗапросЗайвих.УстановитьПараметр("Нач", НачалоПериода);
	ЗапросЗайвих.УстановитьПараметр("Кон", КонецДня(ОкончаниеПериода));

	ВыбЗайвих = ЗапросЗайвих.Выполнить().Выбрать();
	КолЗайвих = 0;

	Пока ВыбЗайвих.Следующий() Цикл
		КлючДокОсн = XMLСтрока(ВыбЗайвих.ДокОснование);
		СписокПарДокОснов = ДокументыСДисбалансом.Получить(КлючДокОсн);

		// Перевірити, чи ця пара контрагентів є у списку актуальних пар
		ПараАктуальна = Ложь;
		Если СписокПарДокОснов <> Неопределено Тогда
			Для Каждого ПАРА2 Из СписокПарДокОснов Цикл
				ПартнерДт2 = НайтиПартнераПоПодразделению(ПАРА2.ПодрДебитор);
				ПартнерКт2 = НайтиПартнераПоПодразделению(ПАРА2.ПодрКредитор);
				КДт2 = ?(ПартнерДт2 = Неопределено, Неопределено, НайтиКонтрагентаПоПартнеру(ПартнерДт2));
				ККт2 = ?(ПартнерКт2 = Неопределено, Неопределено, НайтиКонтрагентаПоПартнеру(ПартнерКт2));
				Если КДт2 = ВыбЗайвих.КонтрагентДебитор И ККт2 = ВыбЗайвих.КонтрагентКредитор Тогда
					ПараАктуальна = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		Если ПараАктуальна Тогда
			Продолжить; // ця пара ще потрібна — не зайвий
		КонецЕсли;

		// Фільтр по підрозділу (якщо заданий) — за іменем контрагента
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ИмяПодр = Строка(Подразделение);
			ИмяДеб = ?(ЗначениеЗаполнено(ВыбЗайвих.КонтрагентДебитор), Строка(ВыбЗайвих.КонтрагентДебитор), "");
			ИмяКред = ?(ЗначениеЗаполнено(ВыбЗайвих.КонтрагентКредитор), Строка(ВыбЗайвих.КонтрагентКредитор), "");
			Если ИмяДеб <> ИмяПодр И ИмяКред <> ИмяПодр Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		НС = ДокументыДисбаланса.Добавить();
		НС.Обработан = Ложь;
		НС.Документ = ВыбЗайвих.ДокОснование;
		НС.ПодразделениеПриход = Неопределено;
		НС.ПодразделениеРасход = Неопределено;
		НС.СуммаДокумента = 0;
		НС.ДокВзаимозачетЗадолженности = ВыбЗайвих.Ссылка;
		НС.СуммаВзаимозачета = ВыбЗайвих.СуммаРегл;
		НС.СтатьяДисбаланса = ВыбЗайвих.СтатьяДисбаланса;
		НС.СуммаРасхождение = 0 - ВыбЗайвих.СуммаРегл;
		КолЗайвих = КолЗайвих + 1;
	КонецЦикла;

	// === 5. Статистика ===
	КолНових = 0;
	КолОК = 0;
	КолПереформ = 0;
	КолРасхДог = 0;
	Для Каждого Стр Из ДокументыДисбаланса Цикл
		Если Стр.РасхождениеДоговор Тогда
			КолРасхДог = КолРасхДог + 1;
		КонецЕсли;
		Если Стр.Обработан Тогда
			КолОК = КолОК + 1;
		ИначеЕсли НЕ ЗначениеЗаполнено(Стр.ДокВзаимозачетЗадолженности) И Стр.СуммаДокумента > 0 Тогда
			КолНових = КолНових + 1;
		Иначе
			КолПереформ = КолПереформ + 1;
		КонецЕсли;
	КонецЦикла;

	Сообщить("Результат анализа за " + Формат(НачалоПериода, "ДЛФ=D") + " - " + Формат(ОкончаниеПериода, "ДЛФ=D") + ":");
	Сообщить("  Всего пар дисбаланса: " + ДокументыДисбаланса.Количество());
	Сообщить("  Обработано (ОК): " + КолОК);
	Сообщить("  Новых (создать): " + КолНових);
	Сообщить("  Переформировать: " + КолПереформ);
	Сообщить("  Зайвих (распровести): " + КолЗайвих);
	Если КолРасхДог > 0 Тогда
		Сообщить("  Расхождение договоров: " + КолРасхДог);
	КонецЕсли;

КонецПроцедуры


Процедура СоздатьДокументы() Экспорт

	КолСоздано = 0;
	КолРаспров = 0;
	КолОшибок = 0;

	Для Каждого Стр Из ДокументыДисбаланса Цикл
		Если Стр.Обработан Тогда
			Продолжить;
		КонецЕсли;

		// Зайвий — розпровести
		Если Стр.СуммаДокумента = 0 И ЗначениеЗаполнено(Стр.ДокВзаимозачетЗадолженности) Тогда
			Попытка
				ДокОбъект = Стр.ДокВзаимозачетЗадолженности.ПолучитьОбъект();
				Если ДокОбъект.Проведен Тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Сообщить("Распроведен зайвий: " + Стр.ДокВзаимозачетЗадолженности);
					КолРаспров = КолРаспров + 1;
				КонецЕсли;
				Стр.Обработан = Истина;
			Исключение
				Сообщить("ОШИБКА распроведения: " + ОписаниеОшибки());
				КолОшибок = КолОшибок + 1;
			КонецПопытки;
			Продолжить;
		КонецЕсли;

		// Створити/переформувати Взаємозалік по парі підрозділів
		Попытка
			НоваяСсылка = СоздатьВзаимозачетПоПаре(
				Стр.Документ,
				Стр.ПодразделениеПриход,
				Стр.ПодразделениеРасход,
				Стр.СуммаДокумента);
			Если ЗначениеЗаполнено(НоваяСсылка) Тогда
				Стр.ДокВзаимозачетЗадолженности = НоваяСсылка;
				Стр.СуммаВзаимозачета = НоваяСсылка.СуммаРегл;
				Стр.СуммаРасхождение = Стр.СуммаДокумента - НоваяСсылка.СуммаРегл;
				Стр.РасхождениеДоговор = ПроверитьДоговорыВзаимозачета(
					НоваяСсылка, Стр.ПодразделениеПриход, Стр.ПодразделениеРасход);
				Стр.Обработан = НоваяСсылка.Проведен И Окр(Стр.СуммаРасхождение, 2) = 0 И НЕ Стр.РасхождениеДоговор;
				КолСоздано = КолСоздано + 1;
			КонецЕсли;
		Исключение
			Сообщить("ОШИБКА для " + Стр.Документ + " (пара "
				+ Строка(Стр.ПодразделениеПриход) + " <- " + Строка(Стр.ПодразделениеРасход)
				+ "): " + ОписаниеОшибки());
			КолОшибок = КолОшибок + 1;
		КонецПопытки;
	КонецЦикла;

	Сообщить("Результат создания документов:");
	Сообщить("  Создано/переформировано: " + КолСоздано);
	Сообщить("  Распроведено зайвих: " + КолРаспров);
	Если КолОшибок > 0 Тогда
		Сообщить("  Ошибок: " + КолОшибок);
	КонецЕсли;

КонецПроцедуры


// ===== Жадний алгоритм пар =====

// Вхід: Соответствие (XMLКлюч -> Структура {Подразделение, Контроль})
// Вихід: Массив Структур {ПодрДебитор, ПодрКредитор, Сумма}
Функция РассчитатьПарыДисбаланса(ПодразделенияСоотв)

	Дебиторы = Новый Массив;
	Кредиторы = Новый Массив;
	Для Каждого КЗ Из ПодразделенияСоотв Цикл
		К = Окр(КЗ.Значение.Контроль, 2);
		Если К > 0 Тогда
			Дебиторы.Добавить(Новый Структура("Подразделение, Контроль", КЗ.Значение.Подразделение, К));
		ИначеЕсли К < 0 Тогда
			Кредиторы.Добавить(Новый Структура("Подразделение, Контроль", КЗ.Значение.Подразделение, -К));
		КонецЕсли;
	КонецЦикла;

	// Сортування по убуванню Контроль (через ТаблицуЗначений)
	ТДеб = Новый ТаблицаЗначений;
	ТДеб.Колонки.Добавить("Подразделение");
	ТДеб.Колонки.Добавить("Контроль");
	Для Каждого Д Из Дебиторы Цикл
		НР = ТДеб.Добавить();
		НР.Подразделение = Д.Подразделение;
		НР.Контроль = Д.Контроль;
	КонецЦикла;
	ТДеб.Сортировать("Контроль УБЫВ");

	ТКред = Новый ТаблицаЗначений;
	ТКред.Колонки.Добавить("Подразделение");
	ТКред.Колонки.Добавить("Контроль");
	Для Каждого К Из Кредиторы Цикл
		НР = ТКред.Добавить();
		НР.Подразделение = К.Подразделение;
		НР.Контроль = К.Контроль;
	КонецЦикла;
	ТКред.Сортировать("Контроль УБЫВ");

	Пары = Новый Массив;
	i = 0;
	j = 0;
	Пока i < ТДеб.Количество() И j < ТКред.Количество() Цикл
		Д = ТДеб[i];
		К = ТКред[j];
		СуммаПары = Мин(Д.Контроль, К.Контроль);
		Если Окр(СуммаПары, 2) < 0.01 Тогда
			// копійчаний залишок — пропустити
			Если Д.Контроль < К.Контроль Тогда
				i = i + 1;
			Иначе
				j = j + 1;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Пары.Добавить(Новый Структура(
			"ПодрДебитор, ПодрКредитор, Сумма",
			Д.Подразделение, К.Подразделение, Окр(СуммаПары, 2)));
		Д.Контроль = Окр(Д.Контроль - СуммаПары, 2);
		К.Контроль = Окр(К.Контроль - СуммаПары, 2);
		Если Д.Контроль < 0.01 Тогда
			i = i + 1;
		КонецЕсли;
		Если К.Контроль < 0.01 Тогда
			j = j + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат Пары;

КонецФункции


// ===== Створення документа ВзаимозачетЗадолженности для пари підрозділів =====

Функция СоздатьВзаимозачетПоПаре(ДокОснование, ПодрДт, ПодрКт, СуммаПары)

	Если НЕ ЗначениеЗаполнено(ДокОснование) ИЛИ НЕ ЗначениеЗаполнено(ПодрДт) ИЛИ НЕ ЗначениеЗаполнено(ПодрКт) Тогда
		Сообщить("СоздатьВзаимозачетПоПаре: не заполнены аргументы");
		Возврат Неопределено;
	КонецЕсли;

	Если Окр(СуммаПары, 2) <= 0 Тогда
		Сообщить("СоздатьВзаимозачетПоПаре: сумма пары <= 0");
		Возврат Неопределено;
	КонецЕсли;

	// === Партнери і контрагенти ===
	ПартнерДт = НайтиПартнераПоПодразделению(ПодрДт);
	Если НЕ ЗначениеЗаполнено(ПартнерДт) Тогда
		Сообщить("Не найден Партнер для подразделения дебитора: " + ПодрДт);
		Возврат Неопределено;
	КонецЕсли;
	КонтрагентДт = НайтиКонтрагентаПоПартнеру(ПартнерДт);
	Если НЕ ЗначениеЗаполнено(КонтрагентДт) Тогда
		Сообщить("Не найден Контрагент для Партнера дебитора: " + ПартнерДт);
		Возврат Неопределено;
	КонецЕсли;

	ПартнерКт = НайтиПартнераПоПодразделению(ПодрКт);
	Если НЕ ЗначениеЗаполнено(ПартнерКт) Тогда
		Сообщить("Не найден Партнер для подразделения кредитора: " + ПодрКт);
		Возврат Неопределено;
	КонецЕсли;
	КонтрагентКт = НайтиКонтрагентаПоПартнеру(ПартнерКт);
	Если НЕ ЗначениеЗаполнено(КонтрагентКт) Тогда
		Сообщить("Не найден Контрагент для Партнера кредитора: " + ПартнерКт);
		Возврат Неопределено;
	КонецЕсли;

	ОрганизацияДок = ДокОснование.Организация;

	// === Договори і ОбъектыРасчетов ===
	ДоговорДебитора = НайтиИлиСоздатьДоговор(КонтрагентДт, ПодрДт,
		Перечисления.ТипыДоговоров.СПоставщиком, ОрганизацияДок, ПодрКт);
	ДоговорКредитора = НайтиИлиСоздатьДоговор(КонтрагентКт, ПодрКт,
		Перечисления.ТипыДоговоров.СПокупателем, ОрганизацияДок, ПодрДт);

	ОбъектРасчетовДт = НайтиОбъектРасчетов(КонтрагентДт,
		Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком, ДоговорДебитора);
	ОбъектРасчетовКт = НайтиОбъектРасчетов(КонтрагентКт,
		Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, ДоговорКредитора);

	// === Стаття дисбалансу ===
	СтатьяДисб = ОпределитьСтатьюДисбаланса(ДокОснование, ПодрДт, ПодрКт);

	// === Пошук існуючого по тройці (Основа, КонтрагентДт, КонтрагентКт) ===
	ДокОбъект = Неопределено;
	СущСсылка = НайтиВзаимозачетПоТройке(ДокОснование, КонтрагентДт, КонтрагентКт);
	Если ЗначениеЗаполнено(СущСсылка) Тогда
		ДокОбъект = СущСсылка.ПолучитьОбъект();
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		ДокОбъект.ДебиторскаяЗадолженность.Очистить();
		ДокОбъект.КредиторскаяЗадолженность.Очистить();
		Сообщить("Обновляем существующий: " + СущСсылка + " (" + Строка(ПодрДт) + " <- " + Строка(ПодрКт) + ")");
	Иначе
		ДокОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
		Сообщить("Создаем новый для пары: " + Строка(ПодрДт) + " <- " + Строка(ПодрКт) + " на " + Формат(СуммаПары, "ЧДЦ=2"));
	КонецЕсли;

	// === Шапка ===
	ДокОбъект.Дата = ДокОснование.Дата;
	ДокОбъект.Организация = ОрганизацияДок;
	ДокОбъект.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Произвольный;
	ДокОбъект.КонтрагентДебитор = КонтрагентДт;
	ДокОбъект.КонтрагентКредитор = КонтрагентКт;
	ДокОбъект.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	ДокОбъект.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокОбъект.СуммаРегл = СуммаПары;
	ДокОбъект.СуммаУпр = СуммаПары;
	ДокОбъект.А_ДокументОснованиеДляБаланса = ДокОснование;
	ДокОбъект.А_ВведенВЕРП = Истина;
	Если ЗначениеЗаполнено(СтатьяДисб) Тогда
		ДокОбъект.А_СтатьяДисбалансаПоПодразделению = СтатьяДисб;
	КонецЕсли;

	ВалютаUAH = Справочники.Валюты.НайтиПоКоду("980");
	Если НЕ ЗначениеЗаполнено(ВалютаUAH) Тогда
		ВалютаUAH = Справочники.Валюты.НайтиПоНаименованию("UAH");
	КонецЕсли;

	// === Дебіторська ===
	СтрокаДеб = ДокОбъект.ДебиторскаяЗадолженность.Добавить();
	СтрокаДеб.Партнер = ПартнерДт;
	СтрокаДеб.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	СтрокаДеб.СуммаВзаиморасчетов = СуммаПары;
	СтрокаДеб.СуммаРегл = СуммаПары;
	СтрокаДеб.СуммаУпр = СуммаПары;
	СтрокаДеб.ВалютаВзаиморасчетов = ВалютаUAH;
	СтрокаДеб.Организация = ОрганизацияДок;
	Если ЗначениеЗаполнено(ОбъектРасчетовДт) Тогда
		СтрокаДеб.ОбъектРасчетов = ОбъектРасчетовДт;
	КонецЕсли;

	// === Кредиторська ===
	СтрокаКред = ДокОбъект.КредиторскаяЗадолженность.Добавить();
	СтрокаКред.Партнер = ПартнерКт;
	СтрокаКред.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	СтрокаКред.СуммаВзаиморасчетов = СуммаПары;
	СтрокаКред.СуммаРегл = СуммаПары;
	СтрокаКред.СуммаУпр = СуммаПары;
	СтрокаКред.ВалютаВзаиморасчетов = ВалютаUAH;
	СтрокаКред.Организация = ОрганизацияДок;
	Если ЗначениеЗаполнено(ОбъектРасчетовКт) Тогда
		СтрокаКред.ОбъектРасчетов = ОбъектРасчетовКт;
	КонецЕсли;

	// === Провести ===
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Проведено: " + ДокОбъект.Ссылка
			+ " | " + Формат(СуммаПары, "ЧДЦ=2")
			+ " | Дт=" + Строка(ПодрДт) + " | Кт=" + Строка(ПодрКт));
	Исключение
		Сообщить("ОШИБКА проведения: " + ОписаниеОшибки());
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			Сообщить("Записан без проведения: " + ДокОбъект.Ссылка);
		Исключение
			Сообщить("ОШИБКА записи: " + ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
	КонецПопытки;

	Возврат ДокОбъект.Ссылка;

КонецФункции


// ===== Допоміжні функції =====

Функция НайтиВзаимозачетПоТройке(ДокОснование, КонтрагентДт, КонтрагентКт)

	Если НЕ ЗначениеЗаполнено(КонтрагентДт) ИЛИ НЕ ЗначениеЗаполнено(КонтрагентКт) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК Док
	|ГДЕ
	|	Док.А_ДокументОснованиеДляБаланса = &ДокОснование
	|	И Док.КонтрагентДебитор = &КонтрагентДт
	|	И Док.КонтрагентКредитор = &КонтрагентКт
	|	И НЕ Док.ПометкаУдаления";
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	Запрос.УстановитьПараметр("КонтрагентДт", КонтрагентДт);
	Запрос.УстановитьПараметр("КонтрагентКт", КонтрагентКт);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выб = Результат.Выбрать();
		Выб.Следующий();
		Возврат Выб.Ссылка;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция НайтиПартнераПоПодразделению(Подразделение)

	Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	П.Ссылка КАК Партнер
	|ИЗ
	|	Справочник.Партнеры КАК П
	|ГДЕ
	|	П.А_Подразделение = &Подразделение
	|	И НЕ П.ПометкаУдаления";
	Запрос.УстановитьПараметр("Подразделение", Подразделение);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Запрос2 = Новый Запрос;
		Запрос2.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	П.Ссылка КАК Партнер
		|ИЗ
		|	Справочник.Партнеры КАК П
		|ГДЕ
		|	П.Наименование = &Наименование
		|	И НЕ П.ПометкаУдаления";
		Запрос2.УстановитьПараметр("Наименование", Строка(Подразделение));
		Результат = Запрос2.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

	Выб = Результат.Выбрать();
	Выб.Следующий();
	Возврат Выб.Партнер;

КонецФункции

Функция НайтиКонтрагентаПоПартнеру(Партнер)

	Если НЕ ЗначениеЗаполнено(Партнер) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	К.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК К
	|ГДЕ
	|	К.Партнер = &Партнер
	|	И НЕ К.ПометкаУдаления";
	Запрос.УстановитьПараметр("Партнер", Партнер);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выб = Результат.Выбрать();
	Выб.Следующий();
	Возврат Выб.Контрагент;

КонецФункции

Функция НайтиИлиСоздатьДоговор(Контрагент, Подразделение, ТипДоговора, Организация, ПодразделениеОказанияУслуг)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Д.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Д
	|ГДЕ
	|	Д.Контрагент = &Контрагент
	|	И Д.ТипДоговора = &ТипДоговора
	|	И Д.Подразделение = &Подразделение
	|	И Д.Организация = &Организация
	|	И Д.А_ПодразделениеОказаниеУслугПодразделению = &ПодрОказания
	|	И НЕ Д.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипДоговора", ТипДоговора);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодрОказания", ПодразделениеОказанияУслуг);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выб = Результат.Выбрать();
		Выб.Следующий();
		Возврат Выб.Договор;
	КонецЕсли;

	Попытка
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
		ТипНазва = ?(ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком, "Закупка", "Реализация");
		НовыйДоговор.Наименование = Строка(ПодразделениеОказанияУслуг) + " внутр.(" + ТипНазва + ")";
		НовыйДоговор.Контрагент = Контрагент;
		НовыйДоговор.Партнер = Контрагент.Партнер;
		НовыйДоговор.Организация = Организация;
		НовыйДоговор.Подразделение = Подразделение;
		НовыйДоговор.А_ПодразделениеОказаниеУслугПодразделению = ПодразделениеОказанияУслуг;
		НовыйДоговор.ТипДоговора = ТипДоговора;
		НовыйДоговор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("980");
		НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
		Если ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
			НовыйДоговор.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию(
				"Расчеты с покупателями в национальной валюте");
		Иначе
			НовыйДоговор.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию(
				"Расчеты с поставщиками в национальной валюте");
		КонецЕсли;
		НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		НовыйДоговор.Согласован = Истина;
		НовыйДоговор.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОсвобожденаОтНДС;
		НовыйДоговор.ВариантОформленияЗакупок = Перечисления.ВариантыОформленияЗакупок.НеРазделять;
		НовыйДоговор.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке;
		НовыйДоговор.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;
		НовыйДоговор.Записать();
		Сообщить("Создан договор: " + НовыйДоговор.Наименование);
		Возврат НовыйДоговор.Ссылка;
	Исключение
		Сообщить("Ошибка создания договора: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция НайтиОбъектРасчетов(Контрагент, ТипРасчетов, Договор)

	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОР.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОР
	|ГДЕ
	|	ОР.Контрагент = &Контрагент
	|	И ОР.ТипРасчетов = &ТипРасчетов
	|	И ОР.Договор = &Договор
	|	И НЕ ОР.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипРасчетов", ТипРасчетов);
	Запрос.УстановитьПараметр("Договор", Договор);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выб = Результат.Выбрать();
		Выб.Следующий();
		Возврат Выб.ОбъектРасчетов;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ОпределитьСтатьюДисбаланса(ДокОснование, ПодрДебитор, ПодрКредитор)

	ЗапросСтДеб = Новый Запрос;
	ЗапросСтДеб.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Об.Статья КАК Статья
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы.Обороты(, , Регистратор, ) КАК Об
	|ГДЕ
	|	Об.Регистратор = &Регистратор
	|	И Об.Подразделение = &Подразделение
	|	И НЕ Об.Статья В (
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств))
	|УПОРЯДОЧИТЬ ПО
	|	Об.СуммаПриход - Об.СуммаРасход УБЫВ";
	ЗапросСтДеб.УстановитьПараметр("Регистратор", ДокОснование);
	ЗапросСтДеб.УстановитьПараметр("Подразделение", ПодрДебитор);

	СтатьяДебитора = Неопределено;
	ВыбДеб = ЗапросСтДеб.Выполнить().Выбрать();
	Если ВыбДеб.Следующий() Тогда
		СтатьяДебитора = ВыбДеб.Статья;
	КонецЕсли;

	ЗапросСтКред = Новый Запрос;
	ЗапросСтКред.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Об.Статья КАК Статья
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы.Обороты(, , Регистратор, ) КАК Об
	|ГДЕ
	|	Об.Регистратор = &Регистратор
	|	И Об.Подразделение = &Подразделение
	|	И НЕ Об.Статья В (
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств))
	|УПОРЯДОЧИТЬ ПО
	|	Об.СуммаПриход - Об.СуммаРасход ВОЗР";
	ЗапросСтКред.УстановитьПараметр("Регистратор", ДокОснование);
	ЗапросСтКред.УстановитьПараметр("Подразделение", ПодрКредитор);

	СтатьяКредитора = Неопределено;
	ВыбКред = ЗапросСтКред.Выполнить().Выбрать();
	Если ВыбКред.Следующий() Тогда
		СтатьяКредитора = ВыбКред.Статья;
	КонецЕсли;

	Если ЗначениеЗаполнено(СтатьяДебитора) И ЗначениеЗаполнено(СтатьяКредитора) Тогда
		Возврат НайтиИлиСоздатьДисбалансПоПодразделению(СтатьяДебитора, СтатьяКредитора);
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция НайтиИлиСоздатьДисбалансПоПодразделению(СтатьяДебитора, СтатьяКредитора)

	СписокСтатей = Новый СписокЗначений;
	СписокСтатей.Добавить(СтатьяДебитора);
	СписокСтатей.Добавить(СтатьяКредитора);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Элемент,
	|	КОЛИЧЕСТВО(ТЧ.НомерСтроки) КАК КолСтрок,
	|	СУММА(ВЫБОР
	|		КОГДА ТЧ.Статья В (&СписокСтатей)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Совпадений
	|ИЗ
	|	Справочник.А_ДисбалансПоПодразделению.СтатьиБаланса КАК ТЧ
	|ГДЕ
	|	НЕ ТЧ.Ссылка.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Ссылка";
	Запрос.УстановитьПараметр("СписокСтатей", СписокСтатей);

	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Если Выб.КолСтрок = 2 И Выб.Совпадений = 2 Тогда
			Возврат Выб.Элемент;
		КонецЕсли;
	КонецЦикла;

	Попытка
		НовыйЭл = Справочники.А_ДисбалансПоПодразделению.СоздатьЭлемент();
		НовыйЭл.Наименование = Строка(СтатьяДебитора) + " - " + Строка(СтатьяКредитора);
		Стр1 = НовыйЭл.СтатьиБаланса.Добавить();
		Стр1.Статья = СтатьяДебитора;
		Стр2 = НовыйЭл.СтатьиБаланса.Добавить();
		Стр2.Статья = СтатьяКредитора;
		НовыйЭл.Записать();
		Возврат НовыйЭл.Ссылка;
	Исключение
		Сообщить("Ошибка создания элемента дисбаланса: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция ПроверитьДоговорыВзаимозачета(ВзаимозачетСсылка, ПодрДебитор, ПодрКредитор)

	// Дебіторська сторона: договір має А_ПодрОказ = Кредитор
	ЗапросДеб = Новый Запрос;
	ЗапросДеб.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДЗ.ОбъектРасчетов КАК ОР
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ДЗ
	|ГДЕ
	|	ДЗ.Ссылка = &Вз";
	ЗапросДеб.УстановитьПараметр("Вз", ВзаимозачетСсылка);

	РезДеб = ЗапросДеб.Выполнить().Выбрать();
	Если РезДеб.Следующий() И ЗначениеЗаполнено(РезДеб.ОР) Тогда
		ДоговорДеб = РезДеб.ОР.Договор;
		Если ЗначениеЗаполнено(ДоговорДеб) Тогда
			ПодрДог = ДоговорДеб.А_ПодразделениеОказаниеУслугПодразделению;
			Если НЕ ЗначениеЗаполнено(ПодрДог) ИЛИ ПодрДог <> ПодрКредитор Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	// Кредиторська сторона: договір має А_ПодрОказ = Дебітор
	ЗапросКред = Новый Запрос;
	ЗапросКред.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КЗ.ОбъектРасчетов КАК ОР
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК КЗ
	|ГДЕ
	|	КЗ.Ссылка = &Вз";
	ЗапросКред.УстановитьПараметр("Вз", ВзаимозачетСсылка);

	РезКред = ЗапросКред.Выполнить().Выбрать();
	Если РезКред.Следующий() И ЗначениеЗаполнено(РезКред.ОР) Тогда
		ДоговорКред = РезКред.ОР.Договор;
		Если ЗначениеЗаполнено(ДоговорКред) Тогда
			ПодрДог = ДоговорКред.А_ПодразделениеОказаниеУслугПодразделению;
			Если НЕ ЗначениеЗаполнено(ПодрДог) ИЛИ ПодрДог <> ПодрДебитор Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат Ложь;

КонецФункции
